Центр_управления_производительностью_демо/src/Enums/СостоянияБлокировок/СостоянияБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияБлокировок</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Преобразование</name>
  </enumValues>
  <enumValues>
    <name>Установлена</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Enums/ТипыВыполненийКода/ТипыВыполненийКода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВыполненийКода</name>
  <enumValues>
    <name>СерверныйВызов</name>
  </enumValues>
  <enumValues>
    <name>УстановкаБлокировки</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Catalogs/Показатели/Показатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Показатели</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Анализ</name>
      <description>Анализ</description>
    </items>
    <items>
      <name>Взаимоблокировки</name>
      <description>Взаимоблокировки</description>
    </items>
    <items>
      <name>Запросы</name>
      <description>Запросы</description>
    </items>
    <items>
      <name>Качество</name>
      <description>Качество</description>
    </items>
    <items>
      <name>ОжиданияНаБлокировках</name>
      <description>Ожидания на блокировках</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ПроизводительностьОборудования</name>
      <description>Производительность оборудования</description>
    </items>
    <items>
      <name>СерверныеВызовы</name>
      <description>Серверные вызовы</description>
    </items>
  </predefined>
  <attributes>
    <name>ГраницаЖК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаЗЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметр</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
        <types>EnumRef.СпособыСбораСчетчиков</types>
        <types>CatalogRef.СчетчикиПроизводительности</types>
        <types>CatalogRef.АгентыЦКК</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоддержкаСУБД</name>
    <attributes>
      <name>АвтоматическийРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСУБД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмешанныйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОС</name>
      <type>
        <types>EnumRef.ТипыОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСУБД</name>
      <type>
        <types>EnumRef.ТипыСУБД</types>
      </type>
    </attributes>
    <attributes>
      <name>УправляемыйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/CommonModules/АнализСерверныхВызовов/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// АНАЛИЗ СЕРВЕРНЫХ ВЫЗОВОВ

// Включить сбор информации для анализа серверных вызовов
//
Функция ВключитьСборСерверныхВызовов(ИнформационнаяБаза, Показатели) Экспорт
	
	ОтладкаКлиентСервер.Действие("ВключитьСборСерверныхВызовов");
	
	АнализСерверныхВызововОбъект = Справочники.Показатели.АнализСерверныхВызовов.ПолучитьОбъект();
	МинимальнаяДлительностьВызова = АнализСерверныхВызововОбъект.ПолучитьМинимальнуюДлительностьСерверногоВызова();
	
	// Включить технологический журнал
	ОписательТЖ = ТехнологическийЖурнал.ВключитьТехнологическийЖурнал(
		ТехнологическийЖурнал.КонфигурацияАнализаСерверныхВызовов(
			ИнформационнаяБаза.ИмяИБ,
			МинимальнаяДлительностьВызова),
		ИнформационнаяБаза.ИменаКаталоговТЖ);
		
	// Зафиксировать каталоги ТЖ
	СтрокаПоказателя = ОбщегоНазначенияКлиентСервер.НайтиЭлементМассиваСтруктур(Показатели, "Показатель", Справочники.Показатели.АнализСерверныхВызовов);
	СтрокаПоказателя.ЗамерАнализСерверныхВызовов = Замер.СоздатьЗамер(
		ИнформационнаяБаза,
		СтрокаПоказателя.Показатель,
		СтрокаПоказателя.Экземпляр,
		ИнформационнаяБаза.ТипСУБД);
	Замер.УстановитьКаталогиТЖ(СтрокаПоказателя.ЗамерАнализСерверныхВызовов, ОписательТЖ.КаталогиТЖ);
	
	ОтладкаКлиентСервер.Результат("ВключитьСборСерверныхВызовов");
	
	Возврат ОписательТЖ;
	
КонецФункции // ВключитьСборСерверныхВызовов()

// Отключить сбор информации для анализа серверных вызовов
//
Процедура ОтключитьСборСерверныхВызовов(ИнформационнаяБаза, Показатели, АнализНеобходим, ОписательТЖ) Экспорт
	
	ОтладкаКлиентСервер.Действие("ОтключитьСборСерверныхВызовов");
	
	// Отключить технологический журнал
	ТехнологическийЖурнал.ОтключитьТехнологическийЖурнал(
		ОписательТЖ,
		ИнформационнаяБаза.ИменаКаталоговТЖ);
		
	СтрокаПоказателя = ОбщегоНазначенияКлиентСервер.НайтиЭлементМассиваСтруктур(Показатели, "Показатель", Справочники.Показатели.АнализСерверныхВызовов);
	Замер.ЗавершитьЗамер(СтрокаПоказателя.ЗамерАнализСерверныхВызовов);
	
	Если Не АнализНеобходим Тогда
		Замер.Отменить(СтрокаПоказателя.ЗамерАнализСерверныхВызовов);
	КонецЕсли;
	
	ОтладкаКлиентСервер.Результат("ОтключитьСборСерверныхВызовов");
	
КонецПроцедуры // ОтключитьСборСерверныхВызовов()

// Провести анализ серверных вызовов
//
// Параметры:
//  КонтекстАнализа - Структура
//
Процедура ПроанализироватьСерверныеВызовы(КонтекстАнализа) Экспорт
	
	Перем Блокировка;
	
	ОтладкаКлиентСервер.Действие("ПроанализироватьСерверныеВызовы");
	
	// Получить структуру базы
	СтруктураБазы = КонтекстАнализа.СтруктураБазы.СУБД;
	СловарьШаблонов = КонтекстАнализа.СловарьШаблонов;
	
	ТехнологическийЖурнал.ОчиститьИсходныеДанныеДляАнализа(КонтекстАнализа.Замер);
	
	// Получить минимальную длительность запроса
	АнализСерверныхВызововОбъект = Справочники.Показатели.АнализСерверныхВызовов.ПолучитьОбъект();
	МинимальнаяДлительностьВызова = АнализСерверныхВызововОбъект.ПолучитьМинимальнуюДлительностьСерверногоВызова();
	
	// Получить информацию о серверных вызовах
	РезультатЗапроса = ТехнологическийЖурнал.ПроанализироватьСерверныеВызовы(КонтекстАнализа.Замер).Выбрать();
	
	КоличествоВызовов = 0;
	
	// Обработать серверные вызовы
	Пока РезультатЗапроса.Следующий() Цикл
		
		// Создать описание серверного вызова
		ОписаниеВыполнения = Анализ.СоздатьОписаниеБлокировки();
		ОписаниеВыполнения.КонтекстВыполнения = Строка(РезультатЗапроса.КонтекстКлиента) + Строка(РезультатЗапроса.КонтекстСервера);
		ОписаниеВыполнения.ВремяВыполненияМс = РезультатЗапроса.ВремяВыполненияМс;
		ОписаниеВыполнения.МоментВремениОкончания = РезультатЗапроса.МоментВремени;
		ОписаниеВыполнения.ДатаВремяСобытия = РезультатЗапроса.ДатаВремяСобытия;
		ОписаниеВыполнения.Компьютер = РезультатЗапроса.Компьютер;
		ОписаниеВыполнения.Пользователь = РезультатЗапроса.Пользователь;
		ОписаниеВыполнения.НомерСоединения = РезультатЗапроса.НомерСоединения;
		ОписаниеВыполнения.Состояние = Перечисления.СостоянияБлокировок.Установлена;
		ОписаниеВыполнения.ОбъемНеосвобожденнойПамяти = РезультатЗапроса.ОбъемНеосвобожденнойПамяти;
		ОписаниеВыполнения.МаксимальныйРасходПамяти = РезультатЗапроса.МаксимальныйРасходПамяти;
		ОписаниеВыполнения.СчитаноДанных = РезультатЗапроса.СчитаноДанных;
		ОписаниеВыполнения.ЗаписаноДанных = РезультатЗапроса.ЗаписаноДанных;
		ОписаниеВыполнения.ТипВыполнения = Перечисления.ТипыВыполненийКода.СерверныйВызов;
		
		// Создать документ выполнения кода для каждого серверного вызова
		НачатьТранзакцию();
		
		Попытка
			ВыполнениеКода = СтруктураДанных.ЗафиксироватьВыполнениеКода(ОписаниеВыполнения, КонтекстАнализа);
			КоличествоВызовов = КоличествоВызовов + 1;
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	ОтладкаКлиентСервер.Результат("ПроанализироватьСерверныеВызовы", КоличествоВызовов);
	
КонецПроцедуры // ПроанализироватьЗапросы()
